name: "densenet_onnx"
platform: "onnxruntime_onnx"
max_batch_size: 0

input [
  {
    name: "data_0"
    data_type: TYPE_FP32
    dims: [1, 3, 224, 224]
  }
]

output [
  {
    name: "fc6_1"
    data_type: TYPE_FP32
    dims: [1, 1000, 1, 1]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_CPU
  }
]

optimization {
  execution_accelerators {
    gpu_execution_accelerator : [
      {
        name : "tensorrt"
      }
    ]
  }
}
